InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентамиПоОбъектамЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтменыОперацийЗБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтменыОперацийЗБ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОтмененныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыЗалоговыхБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыЗалоговыхБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Остановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыПроцентныхСтавок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыПроцентныхСтавок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акционная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Техническая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ОстановкаНачисленияПроцентов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
        ДокументОстановки = Параметры.Документ; 
		Если ДокументОстановки.Проведен тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		Иначе
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		КонецЕсли;		
		ДатаДок = ДокументОстановки.Дата; 
		Ломбард = ДокументОстановки.Ломбард;
		ОтветственныйСотрудник = ДокументОстановки.ОтветственныйСотрудник; 
		ОтветственныйПользователь = ДокументОстановки.ОтветственныйПользователь;
		Комментарий = ДокументОстановки.Комментарий;
		ЗалоговыйБилет = ДокументОстановки.ПредыдущаяОперация;  
		ДатаОстановки = ДокументОстановки.ДатаОстановкиНачислений;  
		ОснованиеОстановки = ДокументОстановки.ОснованиеОстановкиНачислений;
		ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(ДокументОстановки, ЗалоговыйБилет);
		ЗаполнитьТовары();  
		ЗаполнитьСостояниеЗалоговогоБилета();
		//+Мельников 25.04.24 Отмена операции.
		ДокументОтмены = ПолучитьДокументОтмены(ДокументОстановки); //Было: ДокументОстановки.ДокументОтмены;
		//-Мельников
	ИначеЕсли Параметры.Свойство("ЗалоговыйБилет") Тогда
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет; 
		СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДата(), ЗалоговыйБилет);
		Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		//Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		//  	ОтветственныйСотрудник = ТекПользователь;
		//Иначе
		//	ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;
		//КонецЕсли;
		ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник;
        ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
		ДатаДок = ТекущаяДатаСеанса(); 
		ДатаОстановки = ДатаДок;
		ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(, ЗалоговыйБилет);
		ЗаполнитьТовары(); 
		ЗаполнитьСостояниеЗалоговогоБилета();  
	Иначе 
		Сообщить("Не выбран залоговый билет!"); 
		Отказ = Истина;
	КонецЕсли;
	//+Мельников 25.04.24 Отмена операции.
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НеРедактировать Тогда  
		Элементы.Редактировать.Видимость = Истина;  
		Элементы.ОстановитьНачисление.Доступность = ложь;
		Элементы.Отмена.Заголовок = "Закрыть";
	КонецЕсли;
	Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ЭтаФорма.ТолькоПросмотр = НеРедактировать;  
	Элементы.ДекорацияСтатусДокумента.Заголовок = " Проект "; 
	Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
	Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
	Элементы.Редактировать.Видимость = Ложь;  
	Элементы.ОстановитьНачисление.Доступность = Истина;
	Элементы.Отмена.Заголовок = "Отмена";
КонецПроцедуры   

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументОстановки), ДокументОстановки, неопределено));
КонецПроцедуры

&НаСервере
Функция СоздатьНовуюОстановкуНачислений()
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОстановкаПроцентов;
	ДокументОбъект.Дата = ДатаДок;
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	ДокументОбъект.ПроцентнаяСхема = ЗалоговыйБилет.ПроцентнаяСхема;
	Возврат ДокументОбъект; 
КонецФункции

&НаСервере
Процедура РаспределитьСуммуОплатыСсудыТовары(СуммаОплатыСсуда) 
	СуммаДляРаспределения = СуммаОплатыСсуда;
	СуммаДляРаспределения = окр(СуммаДляРаспределения, 2);
	НомСтрМакс = 0; 
	МаксЗадолженность = 0;
	ЗадолженностьИтог = ТаблицаТоваров.Итог("Задолженность");
	Для каждого Стр Из ТаблицаТоваров Цикл 
		Коэфф = Стр.Задолженность/ЗадолженностьИтог;
		Стр.СуммаОплаты = СуммаОплатыСсуда*Коэфф;
		Стр.ЗадолженностьКон = Стр.Задолженность - Стр.СуммаОплаты;
		СуммаДляРаспределения = СуммаДляРаспределения - Стр.СуммаОплаты;
		Если Стр.Задолженность > МаксЗадолженность Тогда
			МаксЗадолженность = Стр.Задолженность;  
			НомСтрМакс = стр.НомерСтроки-1;
		КонецЕсли;	
	КонецЦикла;
	Если НЕ СуммаДляРаспределения = 0 Тогда
		Стр = ТаблицаТоваров.Получить(НомСтрМакс);
		Стр.СуммаОплаты = Стр.СуммаОплаты + СуммаДляРаспределения;
		Стр.ЗадолженностьКон = Стр.Задолженность - Стр.СуммаОплаты;
	КонецЕсли;  	
КонецПроцедуры	

&НаСервере
Функция РасчитатьДолгПоПроцентам(СуммаЗайма, ПроцентнаяСтавка, ДатаНачалаРасчета, ДатаОкончанияРасчета)
	Если ЗначениеЗаполнено(ДокументОстановки) И ДокументОстановки.Проведен Тогда   
		ДокументОбъект = ДокументОстановки.ПолучитьОбъект();
	Иначе	      
		ДокументОбъект = СоздатьНовуюОстановкуНачислений(); 	    
	КонецЕсли;	    
	СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ЗалоговыйБилет.Дата, ЗалоговыйБилет.Организация);
	Если НЕ СтруктураП = неопределено Тогда
	    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
		ПредельноеЗначениеПроцентов = СуммаЗайма*СтруктураП.ПланкаПроцентов; 
	Иначе
		ПредельноеЗначениеПроцентов = 0;
	КонецЕсли;   
	СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет);
	Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗалоговыйБилет);
	Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОстановкаНачислений(ДокументОбъект, ДатаНачалаРасчета, ДатаОкончанияРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр);
	Если Результат.ПредельноеЗначениеПоДоговору Тогда
	    Сообщить("Достигнуто предельное значение суммы процентов по договору.", Статуссообщения.Информация);
	КонецЕсли; 
	
	Если НЕ Результат.СуммаПроцентов = 0 Тогда
		ТаблицаОплатДетально.Очистить();
		Для каждого стр из ДокументОбъект.НачислениеПроцентовДетально Цикл 
		    НоваяСтр = ТаблицаОплатДетально.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
		КонецЦиклА;	 
	КонецЕсли;
	Возврат Результат.СуммаПроцентов;
КонецФункции	

&НаСервере
Процедура ЗаполнитьСостояниеЗалоговогоБилета() 
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Если ЗначениеЗаполнено(ДокументОстановки) Тогда
		Запрос.УстановитьПараметр("Период", ДатаДок-1); 
	Иначе	
	    Запрос.УстановитьПараметр("Период", ДатаДок); 
	КонецЕсли;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовДень КАК СуммаПроцентовДень,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовСрок КАК СуммаПроцентовСрок
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Период <= &Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	ТаблицаСостояний.Очистить();
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		СтрСостояние = ТаблицаЗапроса.Получить(0);
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Начальные условия займа";
		НоваяСтр.КлючСтроки = 1;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета;
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;
		НоваяСтр.СуммаПроцентовСрок = СтрСостояние.СуммаПроцентовСрок;
		
		КолСтр = ТаблицаЗапроса.Количество()-1;
		СтрСостояние = ТаблицаЗапроса.Получить(КолСтр);
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета до остановки начислений %";
		НоваяСтр.КлючСтроки = 2;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета; 
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;
		Если ЗначениеЗаполнено(ДокументОстановки) тогда   
			ДокументОбъект = ДокументОстановки.ПолучитьОбъект();
		Иначе	
			ДокументОбъект = СоздатьНовуюОстановкуНачислений();			
		КонецЕсли; 
		СуммаПроцентовДолг = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(ДокументОбъект, ДокументОбъект.ПредыдущаяОперация);
		НоваяСтр.СуммаПроцентовДолг = СуммаПроцентовДолг; 
		
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета после остановки начислений %";
		НоваяСтр.КлючСтроки = 3; 
		НоваяСтр.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Остановлен; 
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов; 
		ДатаОкончанияРасчетаПроцентов = НачалоДня(ДатаОстановки); 
		НоваяСтр.СуммаПроцентовДолг = РасчитатьДолгПоПроцентам(СтрСостояние.СуммаЗайма, ЗалоговыйБилет.ПроцентнаяСхема, СтрСостояние.ДатаНачалаРасчетаПроцентов, ДатаОкончанияРасчетаПроцентов);   
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары() 
	Запрос = новый Запрос;   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Если ЗначениеЗаполнено(ДокументОстановки) И ДокументОстановки.Проведен Тогда 
		ДатаПроверки = ДатаДок-1; 
	Иначе	
	    ДатаПроверки = ДатаДок;
	КонецЕсли;	   
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);
	//+Мельников 25.04.24 Отмена операции. Заменил старый запрос т.к. он не учитывал суммы по отмененным операциям.
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	               |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога";
	//Запрос.Текст = "ВЫБРАТЬ
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаОборот КАК СуммаОборот,
	//				|	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
	//				|ИЗ
	//				|	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
	//				|ГДЕ
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ЗалоговыйБилет = &ЗалоговыйБилет
	//				|
	//				|СГРУППИРОВАТЬ ПО
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаОборот,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход";
	//-Мельников
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаТоваров.Очистить();  
	Ном = 0;
	Для каждого стр Из ЗалоговыйБилет.Товары цикл 
		Если ЗалоговыйБилет.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
			Если НЕ Стр.Переоформить тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	      
		Ном = Ном + 1;
		НоваяСтр = ТаблицаТоваров.Добавить(); 
		НоваяСтр.Номерстроки = Стр.Номерстроки;
		НоваяСтр.ОбъектЗалога = стр.ОбъектЗалога; 
		НоваяСтр.Артикул = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЗалоговыйБилет, Ном);
		Статус = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(ДатаПроверки, НоваяСтр.ОбъектЗалога, ЗалоговыйБилет);
		Если НЕ Статус = неопределено тогда
		    НоваяСтр.СтатусОбъектаЗалога = Статус;
	    КонецЕсли;         
	    НоваяСтр.СуммаОценки = стр.СуммаОценкиМаксимальная;
		НоваяСтр.СуммаОценкиЗайм = стр.СуммаСсуды;  
		Отбор = Новый структура;
		Отбор.Вставить("ОбъектЗалога", НоваяСтр.ОбъектЗалога);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ строки.Количество() = 0 тогда			
			//+Мельников 25.04.24 Отмена операции. Изменил.
			НоваяСтр.СуммаОплаты = Строки.Получить(0).СуммаОплаты;
			//НоваяСтр.СуммаОплаты = НоваяСтр.СуммаОценки - Строки.Получить(0).СуммаОборот;
			//-Мельников
		КонецЕсли;	 
		НоваяСтр.Задолженность = НоваяСтр.СуммаОценкиЗайм - НоваяСтр.СуммаОплаты;        		
	Конеццикла;	
	
	ТоварыИтогОценка = ТаблицаТоваров.Итог("СуммаОценки");
	ТоварыИтогОценкаЗайм = ТаблицаТоваров.Итог("СуммаОценкиЗайм");
	ТоварыИтогОплата = ТаблицаТоваров.Итог("СуммаОплаты");
	ТоварыИтогДолг = ТаблицаТоваров.Итог("Задолженность");
КонецПроцедуры	

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	Если ЗначениеЗаполнено(ЗалоговыйБилет) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СнятьСПроведения(Документ)  
	ДокОбъект = Документ.ПолучитьОбъект(); 
	Если ДокОбъект.Проведен Тогда  
		ЗапросП = Новый Запрос;  
		ЗапросП.УстановитьПараметр("ЗБ", ЗалоговыйБилет); 
		ЗапросП.УстановитьПараметр("Ссылка", Документ);  
		ЗапросП.УстановитьПараметр("Дата", ДатаДок);
		ЗапросП.Текст = "ВЫБРАТЬ
		                |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
		                |ИЗ
		                |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
		                |ГДЕ
		                |	ЛБ_ОперацияПоЗалогу.ПредыдущаяОперация = &ЗБ
		                |	И ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА
		                |	И ЛБ_ОперацияПоЗалогу.Дата >= &Дата
		                |	И НЕ ЛБ_ОперацияПоЗалогу.Ссылка = &Ссылка";
		ВыборкаП = ЗапросП.Выполнить().Выбрать();
		Если ВыборкаП.Следующий() тогда 
			Сообщить("По залоговому билету " + СокрЛП(Документ.НомерЗалоговогоБилета) + " есть проведенные документы с более поздней датой. Редактирование запрещено.");
			Возврат Ложь;
		КонецЕсли;                                          
		Попытка
		    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);  
			Возврат Истина;
		Исключение   
			Сообщить("Не удалось снять с проведения документ остановки начисления процентов. Редактирование запрещено.");
			Возврат Ложь;
		КонецПопытки;	
	Иначе
		возврат Истина;
	КонецЕсли;
КонецФункции	


&НаКлиенте
Процедура Редактировать(Команда)
	ПроверкаМожноРедактировать = Истина;
	Если ЭтаФорма.НеРедактировать Тогда 
		Результат = СнятьСПроведения(ДокументОстановки);
		Если НЕ Результат тогда  
			ПроверкаМожноРедактировать = Ложь;
		КонецЕсли;	
		Если ПроверкаМожноРедактировать Тогда  
			НеРедактировать = Ложь;
			Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;
			Этаформа.Открыть();
		КонецЕсли;	
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции.
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаСервере
Функция СоздатьДокументНаСервере()  
	Если ЗначениеЗаполнено(ДокументОстановки) Тогда
		ДокументОбъект = ДокументОстановки.ПолучитьОбъект();
		ДокументОбъект.Дата = ДатаДок;
	Иначе	         		
	    ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
		ДокументОбъект.Дата = ДатаДок;
		ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОстановкаПроцентов;  
	    ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
	    ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
	  	ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель); 
		ДокументОбъект.Залогодатель = ЗалоговыйБилет.Залогодатель;  
		ДокументОбъект.ДокументЗалогодателя = ЗалоговыйБилет.ДокументЗалогодателя;
		ДокументОбъект.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;  
		ДокументОбъект.СрокЗалога = ЗалоговыйБилет.СрокЗалога; 
		ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
		ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;  
		ДокументОбъект.Товары.Загрузить(ДокументОбъект.ПредыдущаяОперация.Товары.Выгрузить());
		ДокументОбъект.Вставки.Загрузить(ДокументОбъект.ПредыдущаяОперация.Вставки.Выгрузить());
		ДокументОбъект.ДополнительныеМеталлы.Загрузить(ДокументОбъект.ПредыдущаяОперация.ДополнительныеМеталлы.Выгрузить());
		ДокументОбъект.Дефекты.Загрузить(ДокументОбъект.ПредыдущаяОперация.Дефекты.Выгрузить());     
		Если ДокументОбъект.ПредыдущаяОперация.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда
			СтрокиТоварыУдалить = Новый СписокЗначений;
			СтрокиДефектыУдалить = Новый СписокЗначений;
			СтрокиВставкиУдалить = Новый СписокЗначений;
			СтрокиДополнительныеМеталлыУдалить = Новый СписокЗначений;
			Для каждого СтрТ Из ДокументОбъект.Товары Цикл  
				Если НЕ СтрТ.Переоформить Тогда
					СтрокиТоварыУдалить.Добавить(СтрТ);
					ОтборТ = Новый Структура;
					ОтборТ.Вставить("КлючСтроки", СтрТ.КлючСтроки); 
					
					СтрокиД = ДокументОбъект.Дефекты.НайтиСтроки(ОтборТ);
					Для каждого СтрД Из СтрокиД Цикл 
						СтрокиДефектыУдалить.Добавить(СтрД);
					КонецЦикла;	 
					
					СтрокиВ = ДокументОбъект.Вставки.НайтиСтроки(ОтборТ);
					Для каждого СтрВ Из СтрокиВ Цикл 
						СтрокиВставкиУдалить.Добавить(СтрВ);
					КонецЦикла;	
					
					СтрокиДМ = ДокументОбъект.ДополнительныеМеталлы.НайтиСтроки(ОтборТ);
					Для каждого СтрДМ Из СтрокиДМ Цикл 
						СтрокиДополнительныеМеталлыУдалить.Добавить(СтрДМ);
					КонецЦикла;	
				КонецЕсли;	
			КонецЦикла;	        
			Для каждого Эл Из СтрокиТоварыУдалить Цикл 
				ДокументОбъект.Товары.Удалить(Эл.Значение);
			КонецЦикла;	
			Для каждого Эл Из СтрокиДефектыУдалить Цикл 
				ДокументОбъект.Дефекты.Удалить(Эл.Значение);
			КонецЦикла;	 
            Для каждого Эл Из СтрокиВставкиУдалить Цикл 
				ДокументОбъект.Вставки.Удалить(Эл.Значение);
			КонецЦикла;	 
            Для каждого Эл Из СтрокиДополнительныеМеталлыУдалить Цикл 
				ДокументОбъект.ДополнительныеМеталлы.Удалить(Эл.Значение);
			КонецЦикла;	 			 
		КонецЕсли;	
	КонецЕсли;	
	ДокументОбъект.Ломбард = Ломбард; 
	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник; 
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь;
	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.ДатаОстановкиНачислений = ДатаОстановки;  
	ДокументОбъект.ОснованиеОстановкиНачислений = ОснованиеОстановки;	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", ДокументОбъект.Залогодатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Фамилия = Выборка.Фамилия;
	    ДокументОбъект.Имя = Выборка.Имя;
	    ДокументОбъект.Отчество = Выборка.Отчество;		
		ДокументОбъект.ДатаРождения = Выборка.ДатаРождения;		
		ДокументОбъект.Гражданство = Выборка.Гражданство;
		ДокументОбъект.Пол = Выборка.Пол;  
		ДокументОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДокументОбъект.ДатаРождения);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументОбъект.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументОбъект.ДокументВид = Выборка.ВидДокумента;
		ДокументОбъект.ДокументГражданство = Выборка.Гражданство;
		ДокументОбъект.ДокументСерия = Выборка.ДокументСерия;
		ДокументОбъект.ДокументНомер = Выборка.ДокументНомер;
		ДокументОбъект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументОбъект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументОбъект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументОбъект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументОбъект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;     
		
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 2);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрНач = Строки.Получить(0);
	ДокументОбъект.ДатаВыкупа = СтрНач.ДатаВозврата;
	ДокументОбъект.ДатаВыкупаЛьготная = СтрНач.ДатаВозвратаЛьготная;	
	ДокументОбъект.СуммаСсуды = СтрНач.СуммаЗайма;  
	
	ДокументОбъект.НачислениеПроцентовДетально.Очистить();
	Для каждого стр из ТаблицаОплатДетально Цикл 
	    НоваяСтр = ДокументОбъект.НачислениеПроцентовДетально.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтр, стр);  
		Если Стр.ДеньНач = 1 Тогда     
			СтавкаП = Стр.ПроцентнаяСтавкаБазовая; 
			Если Стр.ВидПроцентнойСтавки = Перечисления.ЛБ_ВидыПроцентныхСтавок.Акционная Тогда
				Если НЕ Стр.ПроцентнаяСтавкаАкция = 0 Тогда
					СтавкаП = Стр.ПроцентнаяСтавкаАкция;
				ИначеЕсли НЕ Стр.ОтклонениеАкцияОтносительное = 0 Тогда	 
					СтавкаП = Стр.ПроцентнаяСтавкаБазовая + Стр.ПроцентнаяСтавкаБазовая*Стр.ОтклонениеАкцияОтносительное/100;
				ИначеЕсли НЕ Стр.ОтклонениеАкцияАбсолютное = 0 Тогда
					СтавкаП = Стр.ПроцентнаяСтавкаБазовая + Стр.ОтклонениеАкцияАбсолютное;
			    КонецЕсли; 
			КонецЕсли;	
			ДокументОбъект.ПроцентнаяСхема = ставкаП;
		КонецЕсли;	
	КонецЦиклА;    
		    	 	
		
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка           
	    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		ДокументОстановки = ДокументОбъект.Ссылка;
		Возврат ложь;
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
		Возврат Истина;
	КонецПопытки;  
КонецФункции	
	
&НаСервере
Функция ПроверкаДокумента()
	ВсеОК = ПроверитьЗаполнение();
	
	Возврат ВсеОК;
КонецФункции	

&НаКлиенте
Процедура ОстановитьНачисление(Команда)
	Если НеРедактировать тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверкаДокумента() Тогда
		ЕстьНеПроведенные  = СоздатьДокументНаСервере();
		Если НЕ ЕстьНеПроведенные Тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
	        Элементы.Редактировать.Видимость = Истина; 
			Элементы.ОстановитьНачисление.Доступность = Ложь;
		    Элементы.Отмена.Заголовок = "Закрыть"; 
			Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;  
			Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
	   	        ФормаРМП = ВладелецФормы;   
				Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
	                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
				КонецЕсли;	
            КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументОстановки), ДокументОстановки, неопределено));
КонецПроцедуры


&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)
	ЗаполнитьТовары(); 
	ЗаполнитьСостояниеЗалоговогоБилета();  
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОсновная тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно; 
	КонецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОсновная; 
	конецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницы(ТекущаяСтраница)
    Если ТекущаяСтраница = Элементы.СтраницаОсновная Тогда 
		Элементы.Вперед.Доступность = Истина; 
		Элементы.Назад.Доступность = Ложь;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДополнительно Тогда 
		Элементы.Вперед.Доступность = Ложь; 
		Элементы.Назад.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОсновнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПриСменеСтраницы(ТекущаяСтраница);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗалогодателя()
	Возврат  ЗалоговыйБилет.Залогодатель;
КонецФункции

&НаКлиенте
Процедура СтатистикаПоКлиенту(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("Дата", ДатаДок);	 
							
	ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Расчеты(Команда)
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ЭтаФорма.ЗалоговыйБилет);	
	ПараметрыФормы.Вставить("Дата", ЭтаФорма.ДатаДок);
							
	ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтменыПриИзменении(Элемент)
	ЗаполнитьСостояниеЗалоговогоБилета();
КонецПроцедуры

//+Мельников 25.04.24 Отмена операции
&НаКлиенте
Процедура ОтменитьОперацию(Команда)
	
	ПоследняяОперация = ПолучитьИнформациюОЗБ(ЗалоговыйБилет, ТекущаяДата());
	ЛомбардПользователя = ПолучитьЛомбардПольвателя();
	ЛомбардВДокументе = ПолучитьЛомбардВдокументе(ПоследняяОперация.ДокументОперации);

	Если ЛомбардПользователя <> ЛомбардВДокументе Тогда
		Предупреждение("Операция оформлена в другом ломбарде.
		|Действия с документом запрещены!");
		Возврат
	ИначеЕсли Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") <> Формат(ПоследняяОперация.Дата, "ДФ=dd.MM.yyyy") Тогда
		Предупреждение("Отмена операции возможна только в текущем дне.");
		Возврат
	ИначеЕсли ТекущаяДата() - ДатаДок >= 3600 Тогда
		Предупреждение("Прошло больше часа от времени оформления текущей операции.");
		Возврат
	Иначе
		
		Ответ = Вопрос("Выполнить отмену текущей операции?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ДокументПроведен = 	ОтменитьОперациюНаСервере();
			УстановитьВидимость();
			ОбновитьИнтерфейс();
		Иначе
			Возврат;
		КонецЕсли;
		
		Если ДокументПроведен Тогда
			Сообщить("Документ отмены создан"); 
			Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
	   	        ФормаРМП = ВладелецФормы;   
				Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
	                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБ(ЗалоговыйБилет, Дата)
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, Дата,, Истина);
	
	//+Мельников 06.05.24 Сделано на время тестирования. Убрать при запуске ломбардов.
	Если Результат = Неопределено Тогда
		ДатаПроверки = ТекущаяДата() + 94608000; // + три года к дате проверки документа
		Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ДатаПроверки,, Истина);
	КонецЕсли;
	//-Мельников

	ПоследняяОперация = Новый Структура;
	ПоследняяОперация.Вставить("Дата", Результат.Регистратор.Дата);
	ПоследняяОперация.Вставить("ВидОперации", Результат.Регистратор.ВидОперации);
	ПоследняяОперация.Вставить("ДокументОперации", Результат.Регистратор);
	
	Возврат ПоследняяОперация;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардПольвателя()
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардВдокументе(Ссылка)
	Возврат Ссылка.Ломбард;
КонецФункции

&НаСервере
Функция ОтменитьОперациюНаСервере()
	
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОстановкиНачисленияПроцентов;  
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
	ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель); 
	ДокументОбъект.Залогодатель = ЗалоговыйБилет.Залогодатель;  
	ДокументОбъект.ДокументЗалогодателя = ЗалоговыйБилет.ДокументЗалогодателя;
	ДокументОбъект.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;  
	ДокументОбъект.СрокЗалога = ЗалоговыйБилет.СрокЗалога; 
	ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
	ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;  
	ДокументОбъект.Товары.Загрузить(ДокументОбъект.ПредыдущаяОперация.Товары.Выгрузить());
	ДокументОбъект.Вставки.Загрузить(ДокументОбъект.ПредыдущаяОперация.Вставки.Выгрузить());
	ДокументОбъект.ДополнительныеМеталлы.Загрузить(ДокументОбъект.ПредыдущаяОперация.ДополнительныеМеталлы.Выгрузить());
	ДокументОбъект.Дефекты.Загрузить(ДокументОбъект.ПредыдущаяОперация.Дефекты.Выгрузить()); 
	ДокументОбъект.Ломбард = Ломбард; 
	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник;
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь;
	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.ДатаОстановкиНачислений = ДатаОстановки;  
	ДокументОбъект.ОснованиеОстановкиНачислений = ОснованиеОстановки;
	ДокументОбъект.ОтмененныйДокумент = ДокументОстановки;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
	               |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
	               |ИЗ
	               |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";

	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", ДокументОбъект.Залогодатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Фамилия = Выборка.Фамилия;
	    ДокументОбъект.Имя = Выборка.Имя;
	    ДокументОбъект.Отчество = Выборка.Отчество;		
		ДокументОбъект.ДатаРождения = Выборка.ДатаРождения;		
		ДокументОбъект.Гражданство = Выборка.Гражданство;
		ДокументОбъект.Пол = Выборка.Пол;  
		ДокументОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДокументОбъект.ДатаРождения);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";

	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументОбъект.ДокументЗалогодателя);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументОбъект.ДокументВид = Выборка.ВидДокумента;
		ДокументОбъект.ДокументГражданство = Выборка.Гражданство;
		ДокументОбъект.ДокументСерия = Выборка.ДокументСерия;
		ДокументОбъект.ДокументНомер = Выборка.ДокументНомер;
		ДокументОбъект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументОбъект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументОбъект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументОбъект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументОбъект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;     
		
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 2);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрНач = Строки.Получить(0);
	ДокументОбъект.ДатаВыкупа = СтрНач.ДатаВозврата;
	ДокументОбъект.ДатаВыкупаЛьготная = СтрНач.ДатаВозвратаЛьготная;	
	ДокументОбъект.СуммаСсуды = СтрНач.СуммаЗайма;  
	
	СостояниеДоОтменяемойОперации = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ДокументОбъект.НомерЗалоговогоБилета, ДокументОстановки.Дата-1,, Истина);
	
	Если СостояниеДоОтменяемойОперации <> Неопределено Тогда
		ДокументОбъект.СуммаОплаты = -ЭтотОбъект.ДокументОстановки.СуммаОплаты;
		ДокументОбъект.СуммаОплатыПроценты = -ЭтотОбъект.ДокументОстановки.СуммаОплатыПроценты;
		ДокументОбъект.СуммаОплатыСсуда = -ЭтотОбъект.ДокументОстановки.СуммаОплатыСсуда;
		ДокументОбъект.СуммаСсуды = СостояниеДоОтменяемойОперации.Регистратор.СуммаСсуды;
		ДокументОбъект.Выкуп = СостояниеДоОтменяемойОперации.Регистратор.Выкуп;
		ДокументОбъект.ВыдачаЗалога = СостояниеДоОтменяемойОперации.Регистратор.ВыдачаЗалога;
	КонецЕсли;

	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка           
	    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 

		//+МАН 17.06.25 Убрал
		//ДокументОтмены = ДокументОбъект.Ссылка;

		////Установка отментки об отмене документа в отменяемом документе
		//ОтменяемыйДокумент = ДокументОстановки.ПолучитьОбъект();
		//ОтменяемыйДокумент.ДокументОтмены = ДокументОтмены;
		//
		//ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		//
		//Попытка           
		//    ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ОбщегоНазначения.СообщитьПользователю("Не удалось установить отметку в отменяемом документе");
		//КонецПопытки;
		//

		Возврат Истина;
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
		Возврат Ложь;
	КонецПопытки;  
	
КонецФункции

&НаСервере
Процедура УстановитьВидимость()

	ПроверкаПоследующихОпереаций = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ТекущаяДата(),,Истина);
	ЛомбардПользователя = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	Если ДокументОстановки.Проведен И НЕ ТекущаяДата() - ДатаДок >= 3600 И ЛомбардПользователя = ДокументОстановки.Ломбард И
		?(ЗначениеЗаполнено(ДокументОстановки), ?(ПроверкаПоследующихОпереаций = Неопределено, Истина, ?(ПроверкаПоследующихОпереаций.Регистратор = ДокументОстановки, Истина, Ложь)), Ложь) Тогда
		
		Элементы.ОтменитьОперацию.Доступность = Истина;
	Иначе
		Элементы.ОтменитьОперацию.Доступность = Ложь;
	КонецЕсли;

	//+МАН 17.06.25 Изменил
	//Если ЗначениеЗаполнено(ДокументОстановки.ДокументОтмены) Тогда
	Если ЗначениеЗаполнено(ДокументОтмены) Тогда
	//-МАН
	    Элементы.ГруппаОтмена.Видимость = Истина;
		//+Мельников 28.05.24
		Элементы.Расчеты.Доступность = Ложь;
		Элементы.Редактировать.Доступность = Ложь;
		//-Мельников
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументОтменыНажатие(Элемент, СтандартнаяОбработка)
	
	Если ПолучитьВидОперации(ДокументОтмены) = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаОстановкиНачисленияПроцентов") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ДокументОтмены);    
		ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаОперацииПоЗайму", ПараметрыФормы, ЭтаФорма, Истина,,,);	
	Иначе                           
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидОперации(Ссылка)
    Возврат Ссылка.ВидОперации
КонецФункции

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Регистратор;
	КонецЕсли;
	
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
	
КонецФункции
//-Мельников
